greet = "\
· Отвечать на вопросы\n\
· Придумывать истории \n\
· Писать и проверять код\n\
· Решать уравнения и задачи\n\
· Писать статьи, посты и контент план\n\
· Давать подробный Гайд по интересующей вас тематике\n\
\n\
❗️Помните: границы бота - это ваша фантазия!\n\
\n\
🦾Если научитесь правильно правильно писать запросы (промты), то бот станет вашим незаменимым помощником в работе и жизни.\n\
\n\
🚨Важно: теперь бот может выдавать длинные ответы до 2000 знаков. Вам просто придёт несколько сообщений.\n\
\n\
/start \n\
"
greet_again = (
    "Привет! Я бесплатный бот ChatGPT-4. Чтобы начать, просто напиши мне свой вопрос."
)
not_subscribed = "\
    ❗️Извините, Вы ещё не являетесь участником нашего канала!\n\
    Подпишись на канал и нажми кнопку «✅ Готово»"
menu = "Это главное меню. Выбери, что хочешь сгенерировать."
# gen_exit = "ЗАРАБОТАЛО УРААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА"
gen_text = "Вводи свой текст, путник"
gen_wait = "Спокойствие, только спокойствие!"
gen_text_done = "Вот твой текст, путник"
exceeded = "Дневной лимит запросов исчерпан, возвращайтесь завтра."
help_ = "Набери /start или /menu"
gen_image = "Шедевр достойный Эрмитажа создаётся..."
advert = "Отправь текст рекламы, либо фотографию с текстом"
advert_wait = "Выбери пункт в меню"
advert_choose = "Выберите рекламу"
advert_start = "Реклама"
advert_name = "Введите название для рекламы"
advert_edit = "Редактирование"
advert_edit_info = "Введите текст"
notAdmin = "Реклама помогает проекту существовать\nЕсли вы хотите поддержать автора, сбер\n*чья-то карта*"
advert_edit_timer = "Какая переодичность отправки сообщений будет?"
advert_edit_timer_once = "Введите желаемую дату и время отправки(МСК) в формате YYYY-MM-DD HH:MM\nНапример: 2022-06-19 11:13"
advert_edit_timer_many_datetime = (
    "Введите желаемое время отправки(МСК) в формате HH:MM.\nПример запроса: 11:15"
)
advert_edit_timer_many_interval = (
    "Введите желаемый интервал отправки в формате HH:MM.\nПример запроса: 12:13"
)
gen_error = "При генерации что-то пошло не так.\nПопробуйте позже."
img_watermark = "было создано при помощи бота"
